stbenn/nuttx/arch/arm/src/stm32h5/hardware/stm32_octospi.h
/****************************************************************************
 * arch/arm/src/stm32h5/hardware/stm32_qspi.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32_OCTOSPI_H
#define __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32_OCTOSPI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <arch/stm32h5/chip.h>

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* General Characteristics **************************************************/

#define STM32H5_OCTOSPI_MINBITS          8         /* Minimum word width */
#define STM32H5_OCTOSPI_MAXBITS          32        /* Maximum word width */

/* OCTOSPI register offsets ****************************************************/

#define STM32_OCTOSPI_CR_OFFSET       0x0000    /* Control Register */
#define STM32_OCTOSPI_DCR1_OFFSET     0x0008    /* Device Configuration Register 1 */
#define STM32_OCTOSPI_DCR2_OFFSET     0x000c    /* Device Configuration Register 2 */
#define STM32_OCTOSPI_DCR3_OFFSET     0x0010    /* Device Configuration Register 3 */
#define STM32_OCTOSPI_DCR4_OFFSET     0x0014    /* Device Configuration Register 4 */
#define STM32_OCTOSPI_SR_OFFSET       0x0020    /* Status Register */
#define STM32_OCTOSPI_FCR_OFFSET      0x0024    /* Flag Clear Register */
#define STM32_OCTOSPI_DLR_OFFSET      0x0040    /* Data Length Register */
#define STM32_OCTOSPI_AR_OFFSET       0x0048    /* Address Register */
#define STM32_OCTOSPI_DR_OFFSET       0x0050    /* Data Register */
#define STM32_OCTOSPI_PSMKR_OFFSET    0x0080    /* Polling Status mask Register */
#define STM32_OCTOSPI_PSMAR_OFFSET    0x0088    /* Polling Status match Register */
#define STM32_OCTOSPI_PIR_OFFSET      0x0090    /* Polling Interval Register */
#define STM32_OCTOSPI_CCR_OFFSET      0x0100    /* Communication Configuration Register */
#define STM32_OCTOSPI_TCR_OFFSET      0x0108    /* Timing Configuration Register */
#define STM32_OCTOSPI_IR_OFFSET       0x0110    /* Instruction Register */
#define STM32_OCTOSPI_ABR_OFFSET      0x0120    /* Alternate Bytes Register */
#define STM32_OCTOSPI_LPTR_OFFSET     0x0130    /* Low-Power Timeout Register */
#define STM32_OCTOSPI_WPCCR_OFFSET    0x0140    /* Wrap Communication Configuration Register */
#define STM32_OCTOSPI_WPTCR_OFFSET    0x0148    /* Wrap Timing Configuration Register */
#define STM32_OCTOSPI_WPIR_OFFSET     0x0150    /* Wrap Instruction Register */
#define STM32_OCTOSPI_WPABR_OFFSET    0x0160    /* Wrap Alternate Bytes Register */
#define STM32_OCTOSPI_WCCR_OFFSET     0x0180    /* Write Communication Configuration Register */
#define STM32_OCTOSPI_WTCR_OFFSET     0x0188    /* Write Configuration Register */
#define STM32_OCTOSPI_WIR_OFFSET      0x0190    /* Write Instruction Register */
#define STM32_OCTOSPI_WABR_OFFSET     0x01a0    /* Write Alternate Bytes Register */
#define STM32_OCTOSPI_HLCR_OFFSET     0x0200    /* HyperBus Latency Configuration Register */

/* OCTOSPI register addresses **************************************************/

#define STM32_OCTOSPI_CR     (STM32_OCTOSPI_BASE+STM32_OCTOSPI_CR_OFFSET)     /* Control Register */
#define STM32_OCTOSPI_DCR1   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_DCR1_OFFSET)   /* Device Configuration Register 1 */
#define STM32_OCTOSPI_DCR2   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_DCR2_OFFSET)   /* Device Configuration Register 2 */
#define STM32_OCTOSPI_DCR3   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_DCR3_OFFSET)   /* Device Configuration Register 3 */
#define STM32_OCTOSPI_DCR4   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_DCR4_OFFSET)   /* Device Configuration Register 4 */
#define STM32_OCTOSPI_SR     (STM32_OCTOSPI_BASE+STM32_OCTOSPI_SR_OFFSET)     /* Status Register */
#define STM32_OCTOSPI_FCR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_FCR_OFFSET)    /* Flag Clear Register */
#define STM32_OCTOSPI_DLR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_DLR_OFFSET)    /* Data Length Register */
#define STM32_OCTOSPI_AR     (STM32_OCTOSPI_BASE+STM32_OCTOSPI_AR_OFFSET)     /* Address Register */
#define STM32_OCTOSPI_DR     (STM32_OCTOSPI_BASE+STM32_OCTOSPI_DR_OFFSET)     /* Data Register */
#define STM32_OCTOSPI_PSMKR  (STM32_OCTOSPI_BASE+STM32_OCTOSPI_PSMKR_OFFSET)  /* Polling Status mask Register */
#define STM32_OCTOSPI_PSMAR  (STM32_OCTOSPI_BASE+STM32_OCTOSPI_PSMAR_OFFSET)  /* Polling Status match Register */
#define STM32_OCTOSPI_PIR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_PIR_OFFSET)    /* Polling Interval Register */
#define STM32_OCTOSPI_CCR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_CCR_OFFSET)    /* Communication Configuration Register */
#define STM32_OCTOSPI_TCR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_TCR_OFFSET)    /* Timing Configuration Register */
#define STM32_OCTOSPI_IR     (STM32_OCTOSPI_BASE+STM32_OCTOSPI_IR_OFFSET)     /* Instruction Register */
#define STM32_OCTOSPI_ABR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_ABR_OFFSET)    /* Alternate Bytes Register */
#define STM32_OCTOSPI_LPTR   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_LPTR_OFFSET)   /* Low-Power Timeout Register */
#define STM32_OCTOSPI_WPCCR  (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WPCCR_OFFSET)  /* Wrap Communication Configuration Register */
#define STM32_OCTOSPI_WPTCR  (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WPTCR_OFFSET)  /* Wrap Timing Configuration Register */
#define STM32_OCTOSPI_WPIR   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WPIR_OFFSET)   /* Wrap Instruction Register */
#define STM32_OCTOSPI_WPABR  (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WPABR_OFFSET)  /* Wrap Alternate Bytes Register */
#define STM32_OCTOSPI_WCCR   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WCCR_OFFSET)   /* Write Communication Configuration Register */
#define STM32_OCTOSPI_WTCR   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WTCR_OFFSET)   /* Write Configuration Register */
#define STM32_OCTOSPI_WIR    (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WIR_OFFSET)    /* Write Instruction Register */
#define STM32_OCTOSPI_WABR   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_WABR_OFFSET)   /* Write Alternate Bytes Register */
#define STM32_OCTOSPI_HLCR   (STM32_OCTOSPI_BASE+STM32_OCTOSPI_HLCR_OFFSET)   /* HyperBus Latency Configuration Register */

