stbenn/nuttx/arch/arm/src/stm32h5/hardware/stm32_octospi.h
/* OCTOSPI register bit definitions ********************************************/

/* Control Register */

#define OCTOSPI_CR_EN                 (1 << 0)   /* Bit 0:  OCTOSPI Enable */
#define OCTOSPI_CR_ABORT              (1 << 1)   /* Bit 1:  Abort request */
#define OCTOSPI_CR_DMAEN              (1 << 2)   /* Bit 2:  DMA enable */
#define OCTOSPI_CR_TCEN               (1 << 3)   /* Bit 3:  Timeout counter enable */
#define OCTOSPI_CR_DMM                (1 << 6)   /* Bit 6:  DMM: Dual-memory mode */
#define OCTOSPI_CR_MSEL               (1 << 7)   /* Bit 7:  MSEL: Memory selection */
#define OCTOSPI_CR_FTHRES_SHIFT       (8)        /* Bits 8-11: FIFO threshold level */
#define OCTOSPI_CR_FTHRES_MASK        (0x1f << OCTOSPI_CR_FTHRES_SHIFT)
#define OCTOSPI_CR_TEIE               (1 << 16)  /* Bit 16:  Transfer error interrupt enable */
#define OCTOSPI_CR_TCIE               (1 << 17)  /* Bit 17:  Transfer complete interrupt enable */
#define OCTOSPI_CR_FTIE               (1 << 18)  /* Bit 18:  FIFO threshold interrupt enable */
#define OCTOSPI_CR_SMIE               (1 << 19)  /* Bit 19:  Status match interrupt enable */
#define OCTOSPI_CR_TOIE               (1 << 20)  /* Bit 20:  TimeOut interrupt enable */
#define OCTOSPI_CR_APMS               (1 << 22)  /* Bit 22:  Automatic poll mode stop */
#define OCTOSPI_CR_PMM                (1 << 23)  /* Bit 23:  Polling match mode */

#define OCTOSPI_CR_FMODE_SHIFT       (28)        /* Bits 28-29: Functional mode */
#define OCTOSPI_CR_FMODE_MASK        (0x3 << OCTOSPI_CR_FMODE_SHIFT)
#  define OCTOSPI_CR_FMODE(n)        ((uint32_t)(n) << OCTOSPI_CR_FMODE_SHIFT)

#define CR_FMODE_INDWR     0   /* Indirect write mode */
#define CR_FMODE_INDRD     1   /* Indirect read mode */
#define CR_FMODE_AUTOPOLL  2   /* Automatic polling mode */
#define CR_FMODE_MEMMAP    3   /* Memory-mapped mode */

/* Device Configuration Register 1 */

#define OCTOSPI_DCR1_CKMODE             (1 << 0)   /* Bit 0:  Mode 0 / mode 3 */
#define OCTOSPI_DCR1_FRCK               (1 << 1)   /* Bit 1:  Free Running Clock */
#define OCTOSPI_DCR1_DLYBYP             (1 << 2)   /* Bit 2:  Delay block bypass */

#define OCTOSPI_DCR1_CSHT_SHIFT         (8)        /* Bits 8-10: Chip select high time */
#define OCTOSPI_DCR1_CSHT_MASK          (0x3f << OCTOSPI_DCR1_CSHT_SHIFT)
#define OCTOSPI_DCR1_DEVSIZE_SHIFT      (16)       /* Bits 16-20: Flash memory size */

#define OCTOSPI_DCR1_DEVSIZE_MASK       (0x1f << OCTOSPI_DCR1_DEVSIZE_SHIFT)
#define OCTOSPI_DCR1_MTYP_SHIFT         (24)       /* Bits 24-26: Memory Type */
#define OCTOSPI_DCR1_MTYP_MASK          (0x7 << OCTOSPI_DCR1_MTYP_SHIFT)
#define OCTOSPI_DCR1_MTYP_MICRON_MODE   (0x0 << OCTOSPI_DCR1_MTYP_SHIFT)
#define OCTOSPI_DCR1_MTYP_MACRNX_MODE   (0x1 << OCTOSPI_DCR1_MTYP_SHIFT)
#define OCTOSPI_DCR1_MTYP_STD_MODE      (0x2 << OCTOSPI_DCR1_MTYP_SHIFT)
#define OCTOSPI_DCR1_MTYP_MACRNX_RAM    (0x3 << OCTOSPI_DCR1_MTYP_SHIFT)
#define OCTOSPI_DCR1_MTYP_HYPBUS_MEM    (0x4 << OCTOSPI_DCR1_MTYP_SHIFT)
#define OCTOSPI_DCR1_MTYP_HYPBUS_REG    (0x5 << OCTOSPI_DCR1_MTYP_SHIFT)

/* Device Configuration Register 2 */

#define OCTOSPI_DCR2_PRESCALER_SHIFT    (0)       /* Bits 0-7: Clock prescaler */
#define OCTOSPI_DCR2_PRESCALER_MASK     (0xff << OCTOSPI_CR_PRESCALER_SHIFT)

#define OCTOSPI_DCR2_WRAPSIZE_SHIFT    (16)       /* Bits 16-18: Wrap Size */
#define OCTOSPI_DCR2_WRAPSIZE_MASK     (0x7 << OCTOSPI_DCR2_WRAPSIZE_SHIFT) /* Bits 0-7: Clock prescaler */
#define OCTOSPI_DCR2_WRAPSIZE_DIS      (0x0 << OCTOSPI_DCR2_WRAPSIZE_SHIFT) /* Wrapped reads not supported */
#define OCTOSPI_DCR2_WRAPSIZE_16B      (0x2 << OCTOSPI_DCR2_WRAPSIZE_SHIFT) /* Wrapped reads not supported */
#define OCTOSPI_DCR2_WRAPSIZE_32B      (0x3 << OCTOSPI_DCR2_WRAPSIZE_SHIFT) /* Wrapped reads not supported */
#define OCTOSPI_DCR2_WRAPSIZE_64B      (0x4 << OCTOSPI_DCR2_WRAPSIZE_SHIFT) /* Wrapped reads not supported */
#define OCTOSPI_DCR2_WRAPSIZE_128B     (0x5 << OCTOSPI_DCR2_WRAPSIZE_SHIFT) /* Wrapped reads not supported */

/* Device Configuration Register 3 */

#define OCTOSPI_DCR3_CSBOUND_SHIFT    (16)       /* Bits 16-20: Clock prescaler */
#define OCTOSPI_DCR3_CSBOUND_MASK     (0x1f << OCTOSPI_CR_CSBOUND_SHIFT)
#define OCTOSPI_DCR3_CSBOUND(n)       ((n << OCTOSPI_CR_CSBOUND_SHIFT) & OCSOSPI_DCR3_CSBOUND_MASK) /* NCS boundary = 2^n bytes when n = 1-31 */

/* Device Configuration Register 4 */

/* Status Register */

#define OCTOSPI_SR_TEF                (1 << 0)   /* Bit 0:  Transfer error flag */
#define OCTOSPI_SR_TCF                (1 << 1)   /* Bit 1:  Transfer complete flag */
#define OCTOSPI_SR_FTF                (1 << 2)   /* Bit 2:  FIFO threshold flag */
#define OCTOSPI_SR_SMF                (1 << 3)   /* Bit 3:  Status match flag */
#define OCTOSPI_SR_TOF                (1 << 4)   /* Bit 4:  Timeout flag */
#define OCTOSPI_SR_BUSY               (1 << 5)   /* Bit 5:  Busy */
#define OCTOSPI_SR_FLEVEL_SHIFT       (8)        /* Bits 8-12: FIFO threshold level */
#define OCTOSPI_SR_FLEVEL_MASK        (0x3f << OCTOSPI_SR_FLEVEL_SHIFT)

/* Flag Clear Register */

#define OCTOSPI_FCR_CTEF              (1 << 0)   /* Bit 0:  Clear Transfer error flag */
#define OCTOSPI_FCR_CTCF              (1 << 1)   /* Bit 1:  Clear Transfer complete flag */
#define OCTOSPI_FCR_CSMF              (1 << 3)   /* Bit 3:  Clear Status match flag */
#define OCTOSPI_FCR_CTOF              (1 << 4)   /* Bit 4:  Clear Timeout flag */

/* Data Length Register */

/* Instruction Register */

#define OCTOSPI_IR_INSTRUCTION_SHIFT (0)        /* Bits 0-7: Instruction */
#define OCTOSPI_IR_INSTRUCTION_MASK  (0xFFFFffff << OCTOSPI_CCR_INSTRUCTION_SHIFT)
#  define OCTOSPI_IR_INST(n)         ((uint32_t)(n) << OCTOSPI_CCR_INSTRUCTION_SHIFT)

/* Communication Configuration Register */

#define CCR_IMODE_NONE      0   /* No instruction */
#define CCR_IMODE_SINGLE    1   /* Instruction on a single line */
#define CCR_IMODE_DUAL      2   /* Instruction on two lines */
#define CCR_IMODE_QUAD      3   /* Instruction on four lines */

#define CCR_ADMODE_NONE     0   /* No address */
#define CCR_ADMODE_SINGLE   1   /* Address on a single line */
#define CCR_ADMODE_DUAL     2   /* Address on two lines */
#define CCR_ADMODE_QUAD     3   /* Address on four lines */

#define CCR_ADSIZE_8        0   /* 8-bit address */
#define CCR_ADSIZE_16       1   /* 16-bit address */
#define CCR_ADSIZE_24       2   /* 24-bit address */
#define CCR_ADSIZE_32       3   /* 32-bit address */

#define CCR_ABMODE_NONE     0   /* No alternate bytes */
#define CCR_ABMODE_SINGLE   1   /* Alternate bytes on a single line */
#define CCR_ABMODE_DUAL     2   /* Alternate bytes on two lines */
#define CCR_ABMODE_QUAD     3   /* Alternate bytes on four lines */

#define CCR_ABSIZE_8        0   /* 8-bit alternate byte */
#define CCR_ABSIZE_16       1   /* 16-bit alternate bytes */
#define CCR_ABSIZE_24       2   /* 24-bit alternate bytes */
#define CCR_ABSIZE_32       3   /* 32-bit alternate bytes */

#define CCR_DMODE_NONE      0   /* No data */
#define CCR_DMODE_SINGLE    1   /* Data on a single line */
#define CCR_DMODE_DUAL      2   /* Data on two lines */
#define CCR_DMODE_QUAD      3   /* Data on four lines */

#define OCTOSPI_CCR_IMODE_SHIFT       (0)        /* Bits 0-2: Instruction mode */
#define OCTOSPI_CCR_IMODE_MASK        (0x7 << OCTOSPI_CCR_IMODE_SHIFT)
#  define OCTOSPI_CCR_IMODE(n)        ((uint32_t)(n) << OCTOSPI_CCR_IMODE_SHIFT)

#define OCTOSPI_CCR_IDTR              (1 << 3)   /* Bit 3: Instruction double transfer rate */

#define OCTOSPI_CCR_ISIZE_SHIFT       (4)        /* Bits 4-5: Instruction size */
#define OCTOSPI_CCR_ISIZE_MASK        (0x3 << OCTOSPI_CCR_ISIZE_SHIFT)
#  define OCTOSPI_CCR_ISIZE_8b        (0 << OCTOSPI_CCR_ISIZE_SHIFT)
#  define OCTOSPI_CCR_ISIZE_16b       (1 << OCTOSPI_CCR_ISIZE_SHIFT)
#  define OCTOSPI_CCR_ISIZE_24b       (2 << OCTOSPI_CCR_ISIZE_SHIFT)
#  define OCTOSPI_CCR_ISIZE_32b       (3 << OCTOSPI_CCR_ISIZE_SHIFT)

#define OCTOSPI_CCR_ADMODE_SHIFT      (8)        /* Bits 10-11: Address mode */
#define OCTOSPI_CCR_ADMODE_MASK       (0x7 << OCTOSPI_CCR_ADMODE_SHIFT)
#  define OCTOSPI_CCR_ADMODE(n)       ((uint32_t)(n) << OCTOSPI_CCR_ADMODE_SHIFT)

#define OCTOSPI_CCR_ADTR              (1 << 11)   /* Bit 11: Address double transfer rate */

#define OCTOSPI_CCR_ADSIZE_SHIFT      (12)        /* Bits 12-13: Address size */
#define OCTOSPI_CCR_ADSIZE_MASK       (0x3 << OCTOSPI_CCR_ADSIZE_SHIFT)
#  define OCTOSPI_CCR_ADSIZE(n)       ((uint32_t)(n) << OCTOSPI_CCR_ADSIZE_SHIFT)
#  define OCTOSPI_CCR_ADSIZE_8b       (0 << OCTOSPI_CCR_ADSIZE_SHIFT)
#  define OCTOSPI_CCR_ADSIZE_16b      (1 << OCTOSPI_CCR_ADSIZE_SHIFT)
#  define OCTOSPI_CCR_ADSIZE_24b      (2 << OCTOSPI_CCR_ADSIZE_SHIFT)
#  define OCTOSPI_CCR_ADSIZE_32b      (3 << OCTOSPI_CCR_ADSIZE_SHIFT)

#define OCTOSPI_CCR_ABMODE_SHIFT      (16)        /* Bits 16-18: Alternate bytes mode */
#define OCTOSPI_CCR_ABMODE_MASK       (0x7 << OCTOSPI_CCR_ABMODE_SHIFT)
#  define OCTOSPI_CCR_ABMODE(n)       ((uint32_t)(n) << OCTOSPI_CCR_ABMODE_SHIFT)

#define OCTOSPI_CCR_ABDTR              (1 << 19)   /* Bit 19: Alternate-byte double transfer rate */

#define OCTOSPI_CCR_ABSIZE_SHIFT      (20)        /* Bits 20-21: Alternate bytes size */
#define OCTOSPI_CCR_ABSIZE_MASK       (0x3 << OCTOSPI_CCR_ABSIZE_SHIFT)
#  define OCTOSPI_CCR_ABSIZE(n)       ((uint32_t)(n) << OCTOSPI_CCR_ABSIZE_SHIFT)

#define OCTOSPI_CCR_DMODE_SHIFT       (24)        /* Bits 24-25: Data mode */
#define OCTOSPI_CCR_DMODE_MASK        (0x3 << OCTOSPI_CCR_DMODE_SHIFT)
#  define OCTOSPI_CCR_DMODE(n)        ((uint32_t)(n) << OCTOSPI_CCR_DMODE_SHIFT)

