stbenn/nuttx/arch/arm/src/stm32h5/hardware/stm32_octospi.h
#define OCTOSPI_CCR_DDTR              (1 << 27)   /* Bit 27: Data double transfer rate */
#define OCTOSPI_CCR_DQSE              (1 << 29)   /* Bit 29: DQS enable */

/* Timing Configuration Register */

#define OCTOSPI_TCR_DCYC_SHIFT        (0)        /* Bits 0-4: Number of dummy cycles */
#define OCTOSPI_TCR_DCYC_MASK         (0x1f << OCTOSPI_TCR_DCYC_SHIFT)
#  define OCTOSPI_TCR_DCYC(n)         ((uint32_t)(n) << OCTOSPI_TCR_DCYC_SHIFT)

#define OCTOSPI_TCR_DHQC              (1 << 28)   /* Bit 28: Delay hold quarter cycle */
#define OCTOSPI_TCR_SSHIFT            (1 << 30)   /* Bit 30: Sample Shift */

/* Address Register */

/* Alternate Bytes Register */

/* Data Register */

/* Polling Status mask Register */

/* Polling Status match Register */

/* Polling Interval Register */

#define OCTOSPI_PIR_INTERVAL_SHIFT    (0)        /* Bits 0-15: Polling interval */
#define OCTOSPI_PIR_INTERVAL_MASK     (0xFFff << OCTOSPI_PIR_INTERVAL_SHIFT)

/* Low-Power Timeout Register */

#define OCTOSPI_LPTR_TIMEOUT_SHIFT    (0)        /* Bits 0-15: Timeout period */
#define OCTOSPI_LPTR_TIMEOUT_MASK     (0xFFff << OCTOSPI_LPTR_TIMEOUT_SHIFT)

/* Wrap Communication Configuration Register */

#define WPCCR_IMODE_NONE      0   /* No instruction */
#define WPCCR_IMODE_SINGLE    1   /* Instruction on a single line */
#define WPCCR_IMODE_DUAL      2   /* Instruction on two lines */
#define WPCCR_IMODE_QUAD      3   /* Instruction on four lines */

#define WPCCR_ADMODE_NONE     0   /* No address */
#define WPCCR_ADMODE_SINGLE   1   /* Address on a single line */
#define WPCCR_ADMODE_DUAL     2   /* Address on two lines */
#define WPCCR_ADMODE_QUAD     3   /* Address on four lines */

#define WPCCR_ADSIZE_8        0   /* 8-bit address */
#define WPCCR_ADSIZE_16       1   /* 16-bit address */
#define WPCCR_ADSIZE_24       2   /* 24-bit address */
#define WPCCR_ADSIZE_32       3   /* 32-bit address */

#define WPCCR_ABMODE_NONE     0   /* No alternate bytes */
#define WPCCR_ABMODE_SINGLE   1   /* Alternate bytes on a single line */
#define WPCCR_ABMODE_DUAL     2   /* Alternate bytes on two lines */
#define WPCCR_ABMODE_QUAD     3   /* Alternate bytes on four lines */

#define WPCCR_ABSIZE_8        0   /* 8-bit alternate byte */
#define WPCCR_ABSIZE_16       1   /* 16-bit alternate bytes */
#define WPCCR_ABSIZE_24       2   /* 24-bit alternate bytes */
#define WPCCR_ABSIZE_32       3   /* 32-bit alternate bytes */

#define WPCCR_DMODE_NONE      0   /* No data */
#define WPCCR_DMODE_SINGLE    1   /* Data on a single line */
#define WPCCR_DMODE_DUAL      2   /* Data on two lines */
#define WPCCR_DMODE_QUAD      3   /* Data on four lines */

#define OCTOSPI_WPCCR_IMODE_SHIFT       (0)        /* Bits 0-2: Instruction mode */
#define OCTOSPI_WPCCR_IMODE_MASK        (0x7 << OCTOSPI_WPCCR_IMODE_SHIFT)
#  define OCTOSPI_WPCCR_IMODE(n)        ((uint32_t)(n) << OCTOSPI_WPCCR_IMODE_SHIFT)

#define OCTOSPI_WPCCR_IDTR              (1 << 3)   /* Bit 3: Instruction double transfer rate */

#define OCTOSPI_WPCCR_ISIZE_SHIFT       (4)        /* Bits 4-5: Instruction size */
#define OCTOSPI_WPCCR_ISIZE_MASK        (0x3 << OCTOSPI_WPCCR_ISIZE_SHIFT)
#  define OCTOSPI_WPCCR_ISIZE_8b        (0 << OCTOSPI_WPCCR_ISIZE_SHIFT)
#  define OCTOSPI_WPCCR_ISIZE_16b       (1 << OCTOSPI_WPCCR_ISIZE_SHIFT)
#  define OCTOSPI_WPCCR_ISIZE_24b       (2 << OCTOSPI_WPCCR_ISIZE_SHIFT)
#  define OCTOSPI_WPCCR_ISIZE_32b       (3 << OCTOSPI_WPCCR_ISIZE_SHIFT)

#define OCTOSPI_WPCCR_ADMODE_SHIFT      (8)        /* Bits 10-11: Address mode */
#define OCTOSPI_WPCCR_ADMODE_MASK       (0x7 << OCTOSPI_WPCCR_ADMODE_SHIFT)
#  define OCTOSPI_WPCCR_ADMODE(n)       ((uint32_t)(n) << OCTOSPI_WPCCR_ADMODE_SHIFT)

#define OCTOSPI_WPCCR_ADTR              (1 << 11)   /* Bit 11: Address double transfer rate */

#define OCTOSPI_WPCCR_ADSIZE_SHIFT      (12)        /* Bits 12-13: Address size */
#define OCTOSPI_WPCCR_ADSIZE_MASK       (0x3 << OCTOSPI_WPCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WPCCR_ADSIZE(n)       ((uint32_t)(n) << OCTOSPI_WPCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WPCCR_ADSIZE_8b       (0 << OCTOSPI_WPCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WPCCR_ADSIZE_16b      (1 << OCTOSPI_WPCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WPCCR_ADSIZE_24b      (2 << OCTOSPI_WPCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WPCCR_ADSIZE_32b      (3 << OCTOSPI_WPCCR_ADSIZE_SHIFT)

#define OCTOSPI_WPCCR_ABMODE_SHIFT      (16)        /* Bits 16-18: Alternate bytes mode */
#define OCTOSPI_WPCCR_ABMODE_MASK       (0x7 << OCTOSPI_WPCCR_ABMODE_SHIFT)
#  define OCTOSPI_WPCCR_ABMODE(n)       ((uint32_t)(n) << OCTOSPI_WPCCR_ABMODE_SHIFT)

#define OCTOSPI_WPCCR_ABDTR              (1 << 19)   /* Bit 19: Alternate-byte double transfer rate */

#define OCTOSPI_WPCCR_ABSIZE_SHIFT      (20)        /* Bits 20-21: Alternate bytes size */
#define OCTOSPI_WPCCR_ABSIZE_MASK       (0x3 << OCTOSPI_WPCCR_ABSIZE_SHIFT)
#  define OCTOSPI_WPCCR_ABSIZE(n)       ((uint32_t)(n) << OCTOSPI_WPCCR_ABSIZE_SHIFT)

#define OCTOSPI_WPCCR_DMODE_SHIFT       (24)        /* Bits 24-25: Data mode */
#define OCTOSPI_WPCCR_DMODE_MASK        (0x3 << OCTOSPI_WPCCR_DMODE_SHIFT)
#  define OCTOSPI_WPCCR_DMODE(n)        ((uint32_t)(n) << OCTOSPI_WPCCR_DMODE_SHIFT)

#define OCTOSPI_WPCCR_DDTR              (1 << 27)   /* Bit 27: Data double transfer rate */
#define OCTOSPI_WPCCR_DQSE              (1 << 29)   /* Bit 29: DQS enable */

/* Wrap Timing Configuration Register */

#define OCTOSPI_WPTCR_DCYC_SHIFT        (0)        /* Bits 0-4: Number of dummy cycles */
#define OCTOSPI_WPTCR_DCYC_MASK         (0x1f << OCTOSPI_WPTCR_DCYC_SHIFT)
#  define OCTOSPI_WPTCR_DCYC(n)         ((uint32_t)(n) << OCTOSPI_WPTCR_DCYC_SHIFT)

#define OCTOSPI_WPTCR_DHQC              (1 << 28)   /* Bit 28: Delay hold quarter cycle */
#define OCTOSPI_WPTCR_SSHIFT            (1 << 30)   /* Bit 30: Sample Shift */

/* Write Communication Configuration Register */

#define WCCR_IMODE_NONE      0   /* No instruction */
#define WCCR_IMODE_SINGLE    1   /* Instruction on a single line */
#define WCCR_IMODE_DUAL      2   /* Instruction on two lines */
#define WCCR_IMODE_QUAD      3   /* Instruction on four lines */

#define WCCR_ADMODE_NONE     0   /* No address */
#define WCCR_ADMODE_SINGLE   1   /* Address on a single line */
#define WCCR_ADMODE_DUAL     2   /* Address on two lines */
#define WCCR_ADMODE_QUAD     3   /* Address on four lines */

#define WCCR_ADSIZE_8        0   /* 8-bit address */
#define WCCR_ADSIZE_16       1   /* 16-bit address */
#define WCCR_ADSIZE_24       2   /* 24-bit address */
#define WCCR_ADSIZE_32       3   /* 32-bit address */

#define WCCR_ABMODE_NONE     0   /* No alternate bytes */
#define WCCR_ABMODE_SINGLE   1   /* Alternate bytes on a single line */
#define WCCR_ABMODE_DUAL     2   /* Alternate bytes on two lines */
#define WCCR_ABMODE_QUAD     3   /* Alternate bytes on four lines */

#define WCCR_ABSIZE_8        0   /* 8-bit alternate byte */
#define WCCR_ABSIZE_16       1   /* 16-bit alternate bytes */
#define WCCR_ABSIZE_24       2   /* 24-bit alternate bytes */
#define WCCR_ABSIZE_32       3   /* 32-bit alternate bytes */

