stbenn/nuttx/arch/arm/src/stm32h5/hardware/stm32_octospi.h
#define WCCR_DMODE_NONE      0   /* No data */
#define WCCR_DMODE_SINGLE    1   /* Data on a single line */
#define WCCR_DMODE_DUAL      2   /* Data on two lines */
#define WCCR_DMODE_QUAD      3   /* Data on four lines */

#define OCTOSPI_WCCR_IMODE_SHIFT       (0)        /* Bits 0-2: Instruction mode */
#define OCTOSPI_WCCR_IMODE_MASK        (0x7 << OCTOSPI_WCCR_IMODE_SHIFT)
#  define OCTOSPI_WCCR_IMODE(n)        ((uint32_t)(n) << OCTOSPI_WCCR_IMODE_SHIFT)

#define OCTOSPI_WCCR_IDTR              (1 << 3)   /* Bit 3: Instruction double transfer rate */

#define OCTOSPI_WCCR_ISIZE_SHIFT       (4)        /* Bits 4-5: Instruction size */
#define OCTOSPI_WCCR_ISIZE_MASK        (0x3 << OCTOSPI_WCCR_ISIZE_SHIFT)
#  define OCTOSPI_WCCR_ISIZE_8b        (0 << OCTOSPI_WCCR_ISIZE_SHIFT)
#  define OCTOSPI_WCCR_ISIZE_16b       (1 << OCTOSPI_WCCR_ISIZE_SHIFT)
#  define OCTOSPI_WCCR_ISIZE_24b       (2 << OCTOSPI_WCCR_ISIZE_SHIFT)
#  define OCTOSPI_WCCR_ISIZE_32b       (3 << OCTOSPI_WCCR_ISIZE_SHIFT)

#define OCTOSPI_WCCR_ADMODE_SHIFT      (8)        /* Bits 10-11: Address mode */
#define OCTOSPI_WCCR_ADMODE_MASK       (0x7 << OCTOSPI_WCCR_ADMODE_SHIFT)
#  define OCTOSPI_WCCR_ADMODE(n)       ((uint32_t)(n) << OCTOSPI_WCCR_ADMODE_SHIFT)

#define OCTOSPI_WCCR_ADTR              (1 << 11)   /* Bit 11: Address double transfer rate */

#define OCTOSPI_WCCR_ADSIZE_SHIFT      (12)        /* Bits 12-13: Address size */
#define OCTOSPI_WCCR_ADSIZE_MASK       (0x3 << OCTOSPI_WCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WCCR_ADSIZE(n)       ((uint32_t)(n) << OCTOSPI_WCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WCCR_ADSIZE_8b       (0 << OCTOSPI_WCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WCCR_ADSIZE_16b      (1 << OCTOSPI_WCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WCCR_ADSIZE_24b      (2 << OCTOSPI_WCCR_ADSIZE_SHIFT)
#  define OCTOSPI_WCCR_ADSIZE_32b      (3 << OCTOSPI_WCCR_ADSIZE_SHIFT)

#define OCTOSPI_WCCR_ABMODE_SHIFT      (16)        /* Bits 16-18: Alternate bytes mode */
#define OCTOSPI_WCCR_ABMODE_MASK       (0x7 << OCTOSPI_WCCR_ABMODE_SHIFT)
#  define OCTOSPI_WCCR_ABMODE(n)       ((uint32_t)(n) << OCTOSPI_WCCR_ABMODE_SHIFT)

#define OCTOSPI_WCCR_ABDTR              (1 << 19)   /* Bit 19: Alternate-byte double transfer rate */

#define OCTOSPI_WCCR_ABSIZE_SHIFT      (20)        /* Bits 20-21: Alternate bytes size */
#define OCTOSPI_WCCR_ABSIZE_MASK       (0x3 << OCTOSPI_WCCR_ABSIZE_SHIFT)
#  define OCTOSPI_WCCR_ABSIZE(n)       ((uint32_t)(n) << OCTOSPI_WCCR_ABSIZE_SHIFT)

#define OCTOSPI_WCCR_DMODE_SHIFT       (24)        /* Bits 24-25: Data mode */
#define OCTOSPI_WCCR_DMODE_MASK        (0x3 << OCTOSPI_WCCR_DMODE_SHIFT)
#  define OCTOSPI_WCCR_DMODE(n)        ((uint32_t)(n) << OCTOSPI_WCCR_DMODE_SHIFT)

#define OCTOSPI_WCCR_DDTR              (1 << 27)   /* Bit 27: Data double transfer rate */
#define OCTOSPI_WCCR_DQSE              (1 << 29)   /* Bit 29: DQS enable */

/* Writing Timing Configuration Register */

#define OCTOSPI_WTCR_DCYC_SHIFT        (0)        /* Bits 0-4: Number of dummy cycles */
#define OCTOSPI_WTCR_DCYC_MASK         (0x1f << OCTOSPI_WTCR_DCYC_SHIFT)
#  define OCTOSPI_WTCR_DCYC(n)         ((uint32_t)(n) << OCTOSPI_WTCR_DCYC_SHIFT)

/* HyperBus Latency Configuration Register */

#define OCTOSPI_HLCR_LM                (1 << 0) /* Bit 0: Latency Mode */
#define OCTOSPI_HLCR_WZL               (1 << 1) /* Bit 1: Write Zero Latency */

#define OCTOSPI_HLCR_TACC_SHIFT       (8)        /* Bits 8-15: Access Timing */
#define OCTOSPI_HLCR_TACC_MASK        (0xff << OCTOSPI_HLCR_TACC_SHIFT)
#  define OCTOSPI_HLCR_TACC(n)        ((uint32_t)(n) << OCTOSPI_HLCR_TACC_SHIFT)

#define OCTOSPI_HLCR_TRWR_SHIFT       (16)        /* Bits 16-23: Read-write minimum recovery time */
#define OCTOSPI_HLCR_TRWR_MASK        (0xff << OCTOSPI_HLCR_TRWR_SHIFT)
#  define OCTOSPI_HLCR_TRWR(n)        ((uint32_t)(n) << OCTOSPI_HLCR_TRWR_SHIFT)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32_OCTOSPI_H */
